Repository: zyk1172/Auralis
Catalog: Packages/AuralisCore/Sources/AppShell/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: 填写内网地址及可选外网地址后，Auralis 会同时探测两端；内网 30 秒内可达则优先使用，内网不可达才降级外网。外网请填写完整的 http:// 或 https:// 地址；HTTPS 更安全，HTTP 会明文传输调用 Token。Agent 会通过插件搜索并下载到 NAS 音乐目录（仅下载，不刮削/整理）。
en: After entering a LAN address and an optional WAN address, Auralis probes both; the LAN is preferred when reachable within 30 seconds, falling back to the WAN only when unreachable. Use a full http:// or https:// URL for the WAN; HTTPS is safer since HTTP sends your call token in plain text. The agent searches and downloads via plugins into your NAS music directory (download only, no scraping/organizing).
zh_hant: 填寫內網位址及可選外網位址後，Auralis 會同時探測兩端；內網 30 秒內可達則優先使用，內網不可達才降級外網。外網請填寫完整的 http:// 或 https:// 位址；HTTPS 更安全，HTTP 會明文傳輸呼叫 Token。Agent 會通過外掛搜尋並下載到 NAS 音樂目錄（僅下載，不刮削/整理）。

source: 增量同步
en: Incremental sync

source: 声道
en: Channels
zh_hant: 聲道

source: 处理你的音乐请求（搜索、播放、推荐、收藏等）
en: Process your music request (search, playback, recommendations, favorites, and more)
zh_hant: 處理你的音樂要求（搜尋、播放、推薦、收藏等）

source: 备份与恢复
en: Backup & Restore
zh_hant: 備份與還原

source: 备份内容：App 设置、音乐服务器（含登录凭据）、大模型接口、音乐下载插件（含 Token）。不包含本地数据库、歌曲、专辑、歌单、收藏、播放记录、缓存或下载文件。备份文件使用密码加密，请妥善保管密码。
en: Backup includes: App settings, music servers (with login credentials), model endpoints, and music download plugins (including tokens). It does not include your local database, songs, albums, playlists, favorites, playback history, cache, or downloaded files. The backup file is encrypted with a password — keep the password safe.
zh_hant: 備份內容：App 設定、音樂伺服器（含登入憑證）、大型語言模型介面、音樂下載外掛（含 Token）。不包含本機資料庫、歌曲、專輯、歌單、收藏、播放記錄、快取或下載檔案。備份檔案使用密碼加密，請妥善保管密碼。

source: 备份密码
en: Backup Password
zh_hant: 備份密碼

source: 备份密码（至少 8 位，建议混合大小写与数字）
en: Backup password (at least 8 characters; mixing upper/lowercase and digits is recommended)
zh_hant: 備份密碼（至少 8 位，建議混合大小寫與數字）

source: 备份已加密生成。请保存到「文件」或其它安全位置；恢复时需要同一密码。
en: The backup was created encrypted. Save it to “Files” or another safe location; you will need the same password to restore.
zh_hant: 備份已加密生成。請儲存到「檔案」或其他安全位置；還原時需要同一密碼。

source: 备份文件
en: Backup File
zh_hant: 備份檔案

source: 复制
en: Copy
zh_hant: 複製

source: 复制 AI 回复文本
en: Copy AI Reply Text
zh_hant: 複製 AI 回複文本

source: 复制中…
en: Copying…
zh_hant: 複製中…

source: 复制文本
en: Copy Text
zh_hant: 複製文本

source: 复制日志
en: Copy Log
zh_hant: 複製日誌

source: 复制歌单
en: Duplicate Playlist
zh_hant: 複製歌單

source: 复制错误详情
en: Copy Error Details
zh_hant: 複製錯誤詳情

source: 外网地址
en: WAN Address
zh_hant: 外網位址

source: 外网地址（可选）
en: WAN Address (Optional)
zh_hant: 外網位址（可選）

source: 外网服务器地址（可选）
en: WAN server address (optional)
zh_hant: 外網伺服器位址（可選）

source: 外网服务器地址无效
en: Invalid external server address
zh_hant: 外網伺服器位址無效

source: 外观
en: Appearance
zh_hant: 外觀

source: 大众评价
en: Public Ratings
zh_hant: 大眾評價

source: 大模型
en: Large Language Model
zh_hant: 大型語言模型

source: 大模型、推荐索引与隐私
en: Large Language Model, Recommendation Index & Privacy
zh_hant: 大型語言模型、推薦索引與隱私

source: 好
en: Good

source: 存储到 Keychain
en: Store in Keychain
zh_hant: 儲存到 Keychain

source: 存储安全
en: Storage Security
zh_hant: 儲存安全

source: 学习
en: Learn
zh_hant: 學習

source: 完全重建
en: Full Rebuild

source: 完全重建目录？
en: Fully rebuild the library?
zh_hant: 完全重建目錄？

source: 完成
en: Done

source: 完成批量管理
en: Finish Batch Management

source: 定期完整校验单曲元数据
en: Periodic full track metadata validation
zh_hant: 定期完整驗證單曲中繼資料

source: 密码
en: Password
zh_hant: 密碼

source: 导入失败：%@
en: Import failed: %@
zh_hant: 匯入失敗：%@

source: 导入索引…
en: Import Index…
zh_hant: 匯入索引…

source: 导出备份
en: Export Backup
zh_hant: 導出備份

source: 导出备份…
en: Export Backup…
zh_hant: 導出備份…

source: 导出失败：%@
en: Export failed: %@
zh_hant: 匯出失敗：%@

source: 导出索引…
en: Export Index…
zh_hant: 導出索引…

source: 封面
en: Cover Art

source: 封面来自服务器元数据；详细来源见服务器歌曲信息。
en: Cover art comes from server metadata; see the server's song info for detailed sources.
zh_hant: 封面來自伺服器中繼資料；詳細來源見伺服器歌曲資訊。

source: 将删除当前服务器的所有 V2 分类与 AI 标签。音乐库、下载、播放记录和其他服务器的索引不会受影响；之后可重新开始索引。
en: This deletes all V2 categories and AI tags for the current server. Your music library, downloads, playback history, and indexes of other servers are unaffected; you can restart indexing later.
zh_hant: 將刪除目前伺服器的所有 V2 分類與 AI 標籤。音樂庫、下載、播放記錄和其他伺服器的索引不會受影響；之後可重新開始索引。

source: 将删除本机保存的登录凭据、离线目录与缓存；服务器上的音乐、歌单与收藏不会被删除。
en: Local login credentials, offline library data, and caches will be removed; music, playlists, and favorites on the server are not deleted.
zh_hant: 將刪除本機儲存的登入憑證、離線目錄與快取；伺服器上的音樂、歌單與收藏不會被刪除。

source: 将删除本机已下载的临时音频缓存文件；用户主动下载的离线音乐不会被删除。
en: Temporarily cached audio files on this device will be deleted; user-downloaded offline music is not removed.
zh_hant: 將刪除本機已下載的臨時音訊快取檔案；使用者主動下載的離線音樂不會被刪除。

source: 将删除本机已缓存的全部封面图片。今后封面只按需从服务器加载，不再主动缓存。
en: All cached cover images on this device will be deleted. Covers will be loaded from the server on demand in the future.
zh_hant: 將刪除本機已快取的全部封面圖片。今後封面只按需從伺服器載入，不再主動快取。

source: 将恢复：App 设置、音乐服务器、大模型与音乐下载配置。不会覆盖或删除本地数据库、歌曲、歌单、收藏、播放记录、缓存或下载文件。
en: This restores: App settings, music servers, model configuration, and music download config. It will not overwrite or delete your local database, songs, playlists, favorites, playback history, cache, or downloaded files.
zh_hant: 將還原：App 設定、音樂伺服器、大型語言模型與音樂下載設定。不會覆蓋或刪除本機資料庫、歌曲、歌單、收藏、播放記錄、快取或下載檔案。

source: 将恢复：服务器信息、大模型配置与其他设置。不会覆盖或删除歌曲、歌单、收藏与播放记录。
en: This restores: server info, model configuration, and other settings. It will not overwrite or delete songs, playlists, favorites, or playback history.
zh_hant: 將還原：伺服器資訊、大型語言模型設定與其他設定。不會覆蓋或刪除歌曲、歌單、收藏與播放記錄。

source: 将清空本机目录并从服务器重新拉取全部数据，耗时较长。服务器数据不受影响。
en: This clears the local library and re-downloads all data from the server, which takes a while. Server data is unaffected.
zh_hant: 將清空本機目錄並從伺服器重新下載全部資料，耗時較長。伺服器資料不受影響。

source: 小猫的记忆（AI 助手）
en: Kitten's Memory (AI Assistant)
zh_hant: 小貓的記憶（AI 助理）

source: 尚未添加服务器
en: No Server Added
zh_hant: 尚未新增伺服器

source: 尚未连接服务器，本地目录为空
en: Not connected to a server; local library is empty
zh_hant: 尚未連線伺服器，本機目錄為空

source: 尚未连接音乐服务器
en: Not connected to a music server
zh_hant: 尚未連線音樂伺服器

source: 尽量不重复
en: Avoid Duplicates
zh_hant: 盡量不重複

source: 展开播放器
en: Expand Player
zh_hant: 展開播放器

source: 展开首页、音乐库和设置
en: Expand Home, Music Library, and Settings
zh_hant: 展開首頁、音樂庫和設定

source: 峰值保护
en: Peak Protection
zh_hant: 峰值保護

source: 崩溃日志
en: Crash Log
zh_hant: 崩潰日誌

source: 已下载
en: Downloaded
zh_hant: 已下載

source: 已下载 · %lld 首
en: Downloaded · %lld songs
zh_hant: 已下載 · %lld 首

source: 已保存的服务器
en: Saved Servers
zh_hant: 已儲存的伺服器

source: 已关闭
en: Off
zh_hant: 已關閉

source: 已分类
en: Indexed
zh_hant: 已分類

source: 已取消同步
en: Sync Canceled

source: 已合并视觉结构重复的主题；旧主题选择会自动迁移到最接近的新主题。
en: Visually redundant themes were merged; your old theme selection is migrated to the closest new theme automatically.
zh_hant: 已合併視覺結構重複的主題；舊主題選擇會自動遷移到最接近的新主題。

source: 已同步
en: Synced

source: 已启用
en: Enabled
zh_hant: 已啟用

source: 已启用（AppIntents）
en: Enabled (AppIntents)
zh_hant: 已啟用（AppIntents）

source: 已完成
en: Complete

source: 已撤销
en: Undone
zh_hant: 已撤銷

source: 已收藏
en: Favorited

source: 已暂停
en: Paused
zh_hant: 已暫停

source: 已标记不喜欢
en: Marked as Disliked
zh_hant: 已標記不喜歡

source: 已离线
en: Offline
zh_hant: 已離線

source: 已移除该条下载历史
en: Download history entry removed
zh_hant: 已移除該筆下載歷史

source: 已获取
en: Retrieved
zh_hant: 已取得

source: 已连接 · %lld 首歌曲
en: Connected · %lld songs
zh_hant: 已連線 · %lld 首歌曲

source: 已选择
en: Selected
zh_hant: 已選擇

source: 已选择：%@
en: Selected: %@
zh_hant: 已選擇：%@

source: 已配置
en: Configured
zh_hant: 已設定

source: 已配置 · 存于系统 Keychain
en: Configured · Stored in System Keychain
zh_hant: 已設定 · 儲存於系統 Keychain

source: 常听专辑
en: Top Albums
zh_hant: 常聽專輯

source: 常听歌曲
en: Top Songs
zh_hant: 常聽歌曲

source: 常听艺术家
en: Top Artists
zh_hant: 常聽藝術家

source: 常用歌单
en: Frequent Playlists
zh_hant: 常用歌單

source: 平均每位听众播放次数
en: Average plays per listener
zh_hant: 平均每位聽眾播放次數

source: 平均评分
en: Average rating
zh_hant: 平均評分

source: 年份
en: Year

source: 建立服务器修订基线，完整校验
en: Establishing the server revision baseline; performing a full validation
zh_hant: 建立伺服器修訂基線；執行完整驗證

source: 开启后 Wi-Fi / 有线网络下优先使用服务器原始质量；关闭则限制码率（MP3 320kbps）以节省带宽。
en: When on, original server quality is preferred over Wi-Fi / wired; when off, the bitrate is limited (MP3 320 kbps) to save bandwidth.
zh_hant: 開啟後 Wi-Fi / 有線網路下優先使用伺服器原始品質；關閉則限製位元率（MP3 320kbps）以節省頻寬。

source: 开始/继续全量索引
en: Start / Resume Full Index
zh_hant: 開始/繼續全量索引

source: 开始下载
en: Start Download
zh_hant: 開始下載

source: 开始全量索引
en: Start Full Index
zh_hant: 開始全量索引

source: 强调
en: Accent
zh_hant: 強調

source: 归档
en: Archive
zh_hant: 歸檔

source: 当前专辑结束后停止
en: Stop After Current Album
zh_hant: 目前專輯結束後停止

source: 当前主题色板
en: Current Theme Palette
zh_hant: 目前主題色板

source: 当前使用
en: Currently In Use
zh_hant: 目前使用

source: 当前服务器
en: Current Server
zh_hant: 目前伺服器

source: 当前服务器的推荐索引 V2 已清空，可重新开始索引。
en: Recommendation index V2 for the current server has been cleared. You can restart indexing.
zh_hant: 目前伺服器的推薦索引 V2 已清空，可重新開始索引。

source: 当前歌曲没有可显示的歌词。
en: The current song has no lyrics to display.
zh_hant: 目前歌曲沒有可顯示的歌詞。

source: 当前歌曲结束后停止
en: Stop After Current Song
zh_hant: 目前歌曲結束後停止

source: 当前歌词
en: Current Lyrics
zh_hant: 目前歌詞

source: 当前用户
en: Current user
zh_hant: 目前使用者

source: 当前资料库
en: Current Library
zh_hant: 目前資料庫

source: 当前资料库暂无专辑，可能需要同步或扫描音乐库。
en: No albums are in the current library yet. Try syncing or scanning the library.
zh_hant: 目前資料庫尚無專輯，可能需要同步或掃描音樂庫。

source: 当前资料库暂无艺术家，可能需要同步或扫描音乐库。
en: No artists are in the current library yet. Try syncing or scanning the library.
zh_hant: 目前資料庫尚無藝術家，可能需要同步或掃描音樂庫。

source: 当前队列结束后停止
en: Stop After Current Queue
zh_hant: 目前佇列結束後停止

source: 录音信息
en: Recording Info
zh_hant: 錄音資訊

source: 待处理
en: Pending
zh_hant: 待處理

source: 待播队列
en: Up Next
zh_hant: 待播佇列

source: 很久没听
en: Long Unplayed
zh_hant: 很久沒聽

source: 循环
en: Repeat
zh_hant: 循環

source: 循环模式
en: Repeat Mode
zh_hant: 循環模式

source: 快捷入口
en: Quick Entries

source: 快捷指令
en: Shortcuts

source: 总收听次数
en: Total listens
zh_hant: 總收聽次數

source: 恢复
en: Restore
zh_hant: 還原

source: 恢复备份
en: Restore Backup
zh_hant: 還原備份

source: 恢复完成。服务器不会自动同步，请在「服务器」中手动连接。
en: Restore complete. The server will not sync automatically; connect to it manually under “Server”.
zh_hant: 恢復完成。伺服器不會自動同步，請在「伺服器」中手動連線。

source: 恢复时需要同一密码。密码不会被保存。
en: You need the same password to restore. The password is never saved.
zh_hant: 還原時需要同一密碼。密碼不會被儲存。

source: 恢复默认
en: Restore Defaults
zh_hant: 還原預設

source: 恢复默认布局
en: Restore Default Layout
zh_hant: 恢復預設佈局

source: 恢复默认布局？
en: Restore Default Layout?
zh_hant: 還原預設佈局？

source: 情绪
en: Mood
zh_hant: 情緒

source: 成功
en: Success

# 成功导入 %lld 首；已存在 %lld 首；歌曲已变化 %lld 首；当前音乐库不存在 %lld 首；格式错误 %lld 首。
source: 成功导入 %1$lld 首；已存在 %2$lld 首；歌曲已变化 %3$lld 首；当前音乐库不存在 %4$lld 首；格式错误 %5$lld 首。
en: Successfully imported %lld; already exists %lld; changed %lld; not in current library %lld; format error %lld.
zh_hant: 成功匯入 %lld 首；已存在 %lld 首；歌曲已變化 %lld 首；目前音樂庫不存在 %lld 首；格式錯誤 %lld 首。

source: 打开专辑
en: Open Album
zh_hant: 打開專輯

source: 打开播放列表
en: Open Playlist
zh_hant: 打開播放清單

source: 打开服务器设置
en: Open Server Settings
zh_hant: 打開伺服器設定

source: 打开本地网络设置
en: Open Local Network Settings
zh_hant: 打開本機網路設定

source: 打开艺术家
en: Open Artist
zh_hant: 打開藝術家

source: 批量删除
en: Batch Delete
zh_hant: 批量刪除

source: 技能文件
en: Skill Files
zh_hant: 技能檔案

source: 拉取专辑
en: Fetching albums
zh_hant: 擷取專輯

source: 拉取单曲
en: Fetching tracks
zh_hant: 擷取單曲

source: 拉取数据
en: Fetch Data
zh_hant: 擷取資料

source: 拉取艺术家
en: Fetching artists
zh_hant: 擷取藝術家

source: 按你的播放次数排序
en: Sorted by your play count
zh_hant: 依你的播放次數排序

source: 按真实播放次数统计的专辑
en: Albums ranked by actual play count
zh_hant: 依真實播放次數統計的專輯

source: 按真实播放次数统计的艺术家
en: Artists ranked by actual play count
zh_hant: 依真實播放次數統計的藝術家

source: 换一批
en: Shuffle
zh_hant: 換一批

source: 授权失败，请检查登录状态
en: Authorization failed. Please check your login status.
zh_hant: 授權失敗，請檢查登入狀態

source: 排序
en: Sort

source: 排序方式
en: Sort Order

source: 排队中
en: Queued
zh_hant: 排隊中

source: 探测超时（%llds）
en: Probe timed out (%llds)
zh_hant: 探測逾時（%llds）

source: 接口协议
en: Interface Protocol
zh_hant: 介面協議

source: 接口地址
en: Interface Address
zh_hant: 介面位址

source: 推荐反馈
en: Recommendation Feedback
zh_hant: 推薦回饋

source: 推荐场景
en: Recommendation Context
zh_hant: 推薦情境

source: 推荐索引 V2
en: Recommendation Index V2
zh_hant: 推薦索引 V2

source: 描述你想听的音乐，或让我帮你操作
en: Describe the music you want to hear, or ask me to help you
zh_hant: 描述你想聽的音樂，或讓我幫你操作

source: 插图
en: Illustration
zh_hant: 插圖

source: 搜索
en: Search
zh_hant: 搜尋

source: 搜索会话
en: Search Conversations
zh_hant: 搜尋會話

source: 搜索你的资料库
en: Search Your Library
zh_hant: 搜尋你的資料庫

source: 搜索你的音乐库
en: Search Your Library
zh_hant: 搜尋你的音樂庫

source: 搜索标签
en: Search Tags
zh_hant: 搜尋標籤

source: 搜索音乐库
en: Search Music Library
zh_hant: 搜尋音樂庫

source: 搜索音乐库（兜底）
en: Search Library (Fallback)
zh_hant: 搜尋音樂庫（備援）

source: 撤销
en: Undo
zh_hant: 撤銷

source: 播放
en: Play

source: 播放 / 暂停
en: Play / Pause
zh_hant: 播放 / 暫停

source: 播放：%@ · 歌曲：%@ · 来源：%@
en: Playback: %@ · Track: %@ · Source: %@
zh_hant: 播放：%@ · 歌曲：%@ · 來源：%@

# 播放《%@》，艺术家 %@
source: 播放《%1$@》，艺术家 %2$@
en: Play “%@” by %@
zh_hant: 播放《%@》，藝術家 %@

source: 播放下一首
en: Play Next

source: 播放与音质
en: Playback & Audio Quality
zh_hant: 播放與音質

source: 播放中
en: Playing

source: 播放全部
en: Play All

source: 播放列表
en: Playlists
zh_hant: 播放清單

source: 播放列表名称
en: Playlist Name
zh_hant: 播放清單名稱

source: 播放失败
en: Playback Failed
zh_hant: 播放失敗

source: 播放所选 %lld 首
en: Play %lld Selected
zh_hant: 播放所選 %lld 首

source: 播放模式：%@
en: Playback Mode: %@

source: 播放次数
en: Play Count
zh_hant: 播放次數

source: 播放过的歌曲会先出现在「最近播放」，过一段时间没听就会回到这里。
en: Played songs first appear in Recently Played and return here after a period of inactivity.
zh_hant: 播放過的歌曲會先出現在「最近播放」，一段時間未播放後就會回到這裡。

source: 播放过的歌曲会按专辑统计在这里。
en: Played songs are grouped by album here.
zh_hant: 播放過的歌曲會按專輯統計在這裡。

source: 播放过的歌曲会按次数统计在这里。
en: Played songs are counted here.
zh_hant: 播放過的歌曲會按次數統計在這裡。

source: 播放过的歌曲会按艺术家统计在这里。
en: Played songs are grouped by artist here.
zh_hant: 播放過的歌曲會按藝術家統計在這裡。

source: 播放进度
en: Playback Progress
zh_hant: 播放進度

source: 播放页面
en: Playback Page
zh_hant: 播放頁面

source: 操作
en: Actions

source: 操作记录
en: Activity Log
zh_hant: 操作記錄

source: 操作记录（%lld）
en: Action History (%lld)
zh_hant: 操作記錄（%lld）

source: 支持 OpenAI Chat Completions、OpenAI Responses API， 以及 DeepSeek、通义千问、Kimi、Ollama、LM Studio 和兼容 OpenAI 协议的中转服务。 API Key 仅保存于系统 Keychain。
en: Supports OpenAI Chat Completions, the OpenAI Responses API, plus DeepSeek, Qwen, Kimi, Ollama, LM Studio, and OpenAI-protocol-compatible relay services. Your API Key is stored only in the system Keychain.
zh_hant: 支援 OpenAI Chat Completions、OpenAI Responses API， 以及 DeepSeek、通義千問、Kimi、Ollama、LM Studio 和相容 OpenAI 協議的中轉服務。 API Key 僅儲存於系統 Keychain。

source: 收听统计
en: Listening Stats
zh_hant: 收聽統計

source: 收听量与评分描述不同人群与时间，不与其他来源合并为综合分。
en: Listen counts and ratings describe different audiences and time periods; they are not merged into a single score across sources.
zh_hant: 收聽量與評分描述不同人群與時間，不與其他來源合併為綜合分。

source: 收藏
en: Favorites

source: 收藏专辑
en: Favorite Album
zh_hant: 收藏專輯

source: 收藏歌曲
en: Favorite Song

source: 收藏艺术家
en: Favorite Artist
zh_hant: 收藏藝術家

source: 收藏里的歌曲会随机出现在这里。
en: Songs from your favorites will appear here at random.
zh_hant: 收藏中的歌曲會隨機出現在這裡。

source: 收藏里随便听
en: Play Random Favorites
zh_hant: 收藏裡隨便聽

source: 收起
en: Collapse

source: 收起播放器
en: Collapse Player

source: 收起详情
en: Collapse Details
zh_hant: 收起詳情

source: 数据与备份
en: Data & Backups
zh_hant: 資料與備份

source: 数据来自 MusicBrainz / CritiqueBrainz / ListenBrainz 公开只读接口，按需查询并本地缓存。
en: Data comes from the public read-only APIs of MusicBrainz / CritiqueBrainz / ListenBrainz, queried on demand and cached locally.
zh_hant: 資料來自 MusicBrainz / CritiqueBrainz / ListenBrainz 公開只讀介面，按需查詢並在本機快取。

source: 文件
en: File
zh_hant: 檔案

source: 新密码（留空则不修改）
en: New Password (leave blank to keep current)
zh_hant: 新密碼（留空則不修改）

source: 新建会话
en: New Conversation
zh_hant: 新建會話

source: 新建播放列表
en: New Playlist
zh_hant: 新建播放清單

source: 无
en: None
zh_hant: 無

source: 无偏好
en: No Preference
zh_hant: 無偏好

source: 无可用歌词
en: No Lyrics Available
zh_hant: 無可用歌詞

source: 无效
en: Invalid
zh_hant: 無效

source: 无法保存
en: Cannot Save
zh_hant: 無法儲存

source: 无法保存服务器设置，请检查名称、用户名和系统 Keychain。
en: Unable to save server settings. Check the name, username, and system Keychain.
zh_hant: 無法儲存伺服器設定，請檢查名稱、使用者名稱與系統 Keychain。

source: 无法删除本地文件，请稍后重试
en: Could not delete the local files. Try again later.
zh_hant: 無法刪除本機檔案，請稍後重試

source: 无法删除歌单
en: Cannot Delete Playlist
zh_hant: 無法刪除歌單

source: 无法取得可播放地址
en: Unable to get playable URL
zh_hant: 無法取得可播放位址

source: 无法定位歌单所属服务器。
en: Unable to locate the server for this playlist.
zh_hant: 無法定位歌單所屬伺服器。

source: 无法获取下载地址，请确认音乐服务器已连接后重试
en: Unable to get the download URL. Make sure the music server is connected and try again.
zh_hant: 無法取得下載位址，請確認音樂伺服器已連線後重試。

source: 无法读取备份文件：%@
en: Could not read the backup file: %@
zh_hant: 無法讀取備份檔案：%@

source: 无法载入该分类
en: Cannot Load This Category
zh_hant: 無法載入該分類

source: 无法连接服务器
en: Cannot Connect to Server
zh_hant: 無法連線伺服器

source: 时长
en: Duration
zh_hant: 時長

source: 显示名称
en: Display Name
zh_hant: 顯示名稱

source: 显示封面
en: Show Cover Art
zh_hant: 顯示封面

source: 显示已归档
en: Show Archived
zh_hant: 顯示已歸檔

source: 显示或隐藏资料库项目、拖动排序
en: Show or hide library items and drag to reorder
zh_hant: 顯示或隱藏資料庫項目、拖動排序

source: 暂停
en: Pause
zh_hant: 暫停

source: 暂无 ListenBrainz 收听数据。
en: No ListenBrainz listening data yet.
zh_hant: 暫無 ListenBrainz 收聽資料。

source: 暂无 MusicBrainz 评分数据。
en: No MusicBrainz ratings available.
zh_hant: 暫無 MusicBrainz 評分資料。

source: 暂无下载
en: No Downloads
zh_hant: 暫無下載

source: 暂无修改型操作
en: No editable actions yet.
zh_hant: 暫無修改型操作

source: 暂无内容
en: No Content
zh_hant: 暫無內容

source: 暂无可核验的大众评价数据。
en: No verifiable public ratings data yet.
zh_hant: 暫無可核驗的大眾評價資料。

source: 暂无播放列表
en: No Playlists
zh_hant: 暫無播放清單

source: 暂无数据
en: No data
zh_hant: 暫無資料

source: 暂无歌单
en: No Playlists
zh_hant: 暫無歌單

source: 暂无歌曲
en: No Songs Yet
zh_hant: 暫無歌曲

source: 暂无歌词
en: No Lyrics
zh_hant: 暫無歌詞

source: 暂无评论。
en: No reviews yet.
zh_hant: 暫無評論。

source: 暂无详情。
en: No details available.
zh_hant: 暫無詳情。

source: 暂时不可用
en: Temporarily unavailable
zh_hant: 暫時不可用

source: 曲目
en: Track

source: 曲目位置
en: Track Position

source: 更多
en: More

source: 更多操作
en: More Actions

source: 更新 API Key
en: Update API Key

source: 更新于 %@
en: Updated %@
zh_hant: 更新於 %@

source: 有收听数据
en: Has Listening Data
zh_hant: 有收聽資料

source: 有效
en: Valid

source: 有评分数据
en: Has Rating Data
zh_hant: 有評分資料

source: 有评论数据
en: Has Review Data
zh_hant: 有評論資料

source: 服务器
en: Server
zh_hant: 伺服器

source: 服务器 %@ 正在同步中
en: Server %@ is already syncing
zh_hant: 伺服器 %@ 正在同步中

source: 服务器上的歌单也会被删除，此操作不可撤销。
en: The playlist on the server will also be deleted. This cannot be undone.
zh_hant: 伺服器上的歌單也會被刪除，此操作不可撤銷。

source: 服务器上这个歌单里还没有添加歌曲。
en: This playlist has no songs on the server yet.
zh_hant: 該歌單在伺服器上尚未新增歌曲。

source: 服务器不可达或认证失败
en: Server is unreachable or authentication failed
zh_hant: 伺服器無法連線或驗證失敗

source: 服务器仅提供数量，执行完整校验
en: The server only provides a count; performing a full validation
zh_hant: 伺服器僅提供數量；執行完整驗證

source: 服务器信息
en: Server Info
zh_hant: 伺服器資訊

source: 服务器可达
en: Server Reachable
zh_hant: 伺服器可達

source: 服务器可连接
en: Server can connect
zh_hant: 伺服器可連線

source: 服务器名称
en: Server Name
zh_hant: 伺服器名稱

source: 服务器名称与资料库统计（运行基础信息）
en: Server name and library statistics (basic runtime information)
zh_hant: 伺服器名稱與資料庫統計（執行基本資訊）

source: 服务器在线结果
en: Server Online Results
zh_hant: 伺服器在線結果

source: 服务器地址
en: Server Address
zh_hant: 伺服器位址

source: 服务器已切换，本次下载已取消
en: Server switched; this download was canceled.
zh_hant: 伺服器已切換，本次下載已取消

source: 服务器摘要
en: Server Summary
zh_hant: 伺服器摘要

source: 服务器无响应
en: Server Not Responding
zh_hant: 伺服器無響應

source: 服务器未确认删除。请检查网络与歌单权限后重试。
en: Server did not confirm deletion. Please check network and playlist permissions and try again.
zh_hant: 伺服器未確認刪除。請檢查網路與歌單權限後重試。

source: 服务器没有返回歌词，稍后可从本地文件或 MusicBrainz 候选补全。
en: The server returned no lyrics. You can fill them later from a local file or MusicBrainz candidates.
zh_hant: 伺服器未傳回歌詞，稍後可從本機檔案或 MusicBrainz 候選項目補全。

source: 服务器类型
en: Server Type
zh_hant: 伺服器類型

source: 服务器返回的流派（来自音乐文件内嵌标签）会显示在这里；连接并同步后即可按流派浏览。
en: Genres returned by the server from embedded music tags will appear here after you connect and sync.
zh_hant: 伺服器回傳的流派（來自音樂檔案內嵌標籤）會顯示在這裡；連線並同步後即可按流派瀏覽。

source: 未下载
en: Not Downloaded
zh_hant: 未下載

source: 未在播放
en: Not Playing

source: 未找到结果
en: No Results Found
zh_hant: 未找到結果

source: 未播放
en: Never played

source: 未收藏
en: Not favorited

source: 未标记不喜欢
en: Not Disliked
zh_hant: 未標記不喜歡

source: 未激活
en: Inactive
zh_hant: 未啟用

source: 未知
en: Unknown

source: 未知资源
en: Unknown Resource
zh_hant: 未知資源

source: 未知错误
en: Unknown Error
zh_hant: 未知錯誤

source: 未设地址
en: No Address Set
zh_hant: 未設位址

source: 未评分
en: Unrated
zh_hant: 未評分

source: 未连接
en: Not Connected
zh_hant: 未連線

source: 未连接服务器
en: Not Connected to a Server
zh_hant: 未連線伺服器

source: 未连接服务器，无法同步目录
en: No server is connected, so the catalog cannot be synced
zh_hant: 未連線伺服器，無法同步目錄

source: 未选择
en: Not Selected
zh_hant: 未選擇

source: 未配置
en: Not Configured
zh_hant: 未設定

source: 未配置模型接口
en: Model Interface Not Configured
zh_hant: 未設定模型介面

source: 本地下载
en: Local downloads
zh_hant: 本機下載

source: 本地持久化资料库中没有同时匹配歌曲、专辑、艺术家或歌单的内容。可以尝试在服务器上在线搜索。
en: No songs, albums, artists, or playlists matched in the local persistent library. Try searching the server online.
zh_hant: 本機持久化資料庫中沒有同時符合歌曲、專輯、藝術家或歌單的內容。可以嘗試在線搜尋伺服器。

source: 本地没有匹配结果
en: No Local Matches
zh_hant: 本機沒有符合的結果

source: 本地目录库打不开，当前运行在临时降级目录上：同步与搜索只对本次会话有效，请检查磁盘空间或应用支持目录。
en: The local library could not be opened; running on a temporary fallback directory. Sync and search only apply to this session. Please check disk space or the app support directory.
zh_hant: 本機目錄庫打不開，目前運行在臨時降級目錄上：同步與搜尋只對本次會話有效，請檢查磁盤空間或應用支援目錄。

source: 本地缓存
en: Local Cache
zh_hant: 本機快取

source: 本地缓存与配置备份
en: Local Cache & Configuration Backups
zh_hant: 本機快取與設定備份

source: 本地网络访问已被 macOS 拒绝。Auralis 会在首次连接时自动申请；若此前点过“不允许”，系统不会再次弹窗。请在“系统设置 → 隐私与安全性 → 本地网络”中打开“Auralis”后重试。
en: macOS denied local network access. Auralis requests it on the first connection; if you previously chose “Don’t Allow”, macOS will not show the prompt again. Open Auralis under System Settings → Privacy & Security → Local Network, then try again.
zh_hant: macOS 拒絕了本機網路存取。Auralis 會在首次連線時自動提出要求；若先前選擇「不允許」，系統不會再次顯示提示。請在「系統設定 → 隱私權與安全性 → 本機網路」中開啟「Auralis」後重試。

source: 本地音乐目录
en: Local Music Directory
zh_hant: 本機音樂目錄

source: 来源：%@
en: Source: %@
zh_hant: 來源：%@

source: 构建
en: Build
zh_hant: 構建

source: 查找歌曲、专辑、艺术家和播放列表。
en: Find songs, albums, artists, and playlists.
zh_hant: 查找歌曲、專輯、藝術家和播放清單。

source: 查看全部
en: View All
zh_hant: 檢視全部

source: 查看原始来源
en: View Original Source
zh_hant: 檢視原始來源

source: 查看诊断
en: View Diagnostics
zh_hant: 檢視診斷

source: 查询失败
en: Query failed
zh_hant: 查詢失敗

source: 标签
en: Tags
zh_hant: 標籤

source: 标题
en: Title
zh_hant: 標題

source: 格式
en: Format

source: 格式：
en: Format:

source: 档位
en: Tier
zh_hant: 檔位

source: 检查并更新索引
en: Check and Update Index
zh_hant: 檢查並更新索引

source: 检查服务器
en: Check Server
zh_hant: 檢查伺服器

source: 检查本地目录是否最新
en: Check whether the local catalog is up to date
zh_hant: 檢查本機目錄是否為最新

source: 检查项
en: Check
zh_hant: 檢查項目

source: 检测到曲目数量变化，完整更新
en: Track count changed; performing a full update
zh_hant: 偵測到曲目數量變化；執行完整更新

source: 检测到资料库内容变化，完整更新
en: Library contents changed; performing a full update
zh_hant: 偵測到資料庫內容變化；執行完整更新

source: 模块显示与排序
en: Module Visibility & Order
zh_hant: 模組顯示與排序

source: 模型
en: Model

source: 模式
en: Mode

source: 歌单
en: Playlists
zh_hant: 歌單

source: 歌单 · %lld 首
en: Playlist · %lld songs
zh_hant: 歌單 · %lld 首

source: 歌单（%lld）
en: Playlists (%lld)
zh_hant: 歌單（%lld）

source: 歌单《%@》
en: Playlist “%@”
zh_hant: 歌單《%@》

source: 歌单不可用
en: Playlist Unavailable
zh_hant: 歌單不可用

source: 歌单为空
en: Playlist Is Empty
zh_hant: 歌單為空

source: 歌单名称
en: Playlist Name
zh_hant: 歌單名稱
